const text = `
内容推广
资源推荐
热榜推荐
允许通知
新手帮助
推送消息
点赞消息
评论消息
个性化服务
天气视频卡片
天气服务推荐
接收小米推送
接收置顶消息
使用个人信息进行推荐
消息推送
推荐内容
推荐内容
资源推荐
猜你喜欢
个性化服务
个性化服务
信息流推荐
桌面搜索框
开启生活早报
接受消息通知
允许Wap推送
猜你喜欢
系统工具广告
//https://zhuanlan.zhihu.com/p/509571194
1、日历 → ┇ → 设置 → 用户体验计划 → 内容推广，关闭；
2、文件管理 → ↓ ( 下载管理 ) → ┇ → 设置 → 信息流设置 → ，关闭；
3、文件管理 → ↓ ( 下载管理 ) → ┇ → 设置 → 信息流设置 → ，关闭；
4、应用商店 → 我的 → 设置 → 通知设置 → ，关闭；
5、应用商店 → 我的 → 设置 → 通知设置 →  → ，关闭；
6、应用商店 → 我的 → 设置 → 通知设置 → ，关闭；
7、应用商店 → 我的 → 设置 → 通知设置 → ；
8、应用商店 → 我的 → 设置 → 隐私设置 → ，关闭；
9、天气 → ┇ → 设置 → 用户体验计划 → ，关闭；
10、天气 → ┇ → 设置 → 用户体验计划 → ，关闭；
11、小米视频 → 我的 → 设置 → 消息与推送 → ，关闭；
12、小米视频 → 我的 → 设置 → 消息与推送 → ，关闭；
13、主题壁纸 → 我的 → 设置 → 个性化推荐，关闭；
14、游戏中心 → 我的 → 设置 → 隐私设置 → ，关闭；
15、小米商城 → 我的 → 设置 → 消息推送 → ，关闭；
16、手机管家 → 安全中心 → 设置 → 垃圾清理 → ，关闭；
17、手机管家 → 安全中心 → 设置 → ，关闭；
18、设置 → 应用设置 → 应用管理 → ┇ → 设置 → ，关闭；
19、打开任一桌面文件夹 → 单击文件夹名称 → ，关闭。
20、小爱同学→设置→关于小爱→关闭“ 加入用户体验计划”→隐私开关→关闭“​
21、小米社区(可以直接卸载) →我的→设置→高级设置→关闭“详情推荐相似”&“个性化推荐”&“”
22、桌面下方搜索栏→右上角三个点→设置→消息通知管理→关闭“允许通知”→返回→搜索快捷方式→关闭“”
23、时钟→右上角→生活早报→关闭‘”
24、浏览器→菜单→设置→主页设置→简洁版→关闭“宫格栏推送”→返回→接收消息通知→关闭“”
25、短信→右上角设置→高级设置(倒数第二个) →关闭“”
26、桌面→打开任意文件夹→点击文件夹名称→关闭“”
27、桌面左滑打开负一屏→划到底部→设置→服务管理→选择关闭项目
28、设置→小米账号→声明与条款→系统广告→→关闭


热门活动
资源推荐
个性化广告推荐
加入用户体验改进计划
评论消息
点赞消息
个性化服务
显示生活早报
宫格位推送
资源推荐
资源推荐
热榜推荐
接收置顶消息
接收置顶消息
今日推荐

// 评论区
MIUI13.0.12（2022-06-04）:
1、设置 → 小米帐号 → 关于小米帐号 → 系统广告 → 系统工具广告，关闭；
2、设置 → 桌面 → 桌面搜索框，关闭；
3、设置 → 桌面 → 智能助理设置 → 实时动态 & 推荐卡片 & ，关闭；
4、设置 → 应用设置 → 应用管理 → ┇ → 设置 → 资源推荐，关闭；
5、设置 → 小爱同学 → 隐私管理 → 隐私设置 →  & ，关闭；
6、打开任一桌面文件夹 → 单击文件夹名称 → 今日推荐，关闭；
7、桌面左滑打开负一屏 → 长按不想看的小部件，移除；
8、手机管家 → 设置 → 垃圾清理 → 推荐内容，关闭；
9、手机管家 → 设置 → 隐私设置 → 个性化推荐，关闭；
10、应用商店 → 我的 → 设置 → 通知设置 → 新手帮助 & 应用更新通知 &  & ，关闭；
11、应用商店 → 我的 → 设置 → 隐私设置 → 个性化服务 → ，关闭；
12、时钟 → ┇ → 生活早报 → 开启生活早报，关闭；
13、时钟 → ┇ → 设置 → 更多闹钟设置 → ，关闭；
14、浏览器 → 我的 → 设置 → 简洁版；，关闭；

可移除：
15、日历 → ┇ → 设置 → 用户体验计划 → 内容推广，关闭；
16、文件管理 → ↓ ( 下载管理 ) → ┇ → 设置 → 信息流设置 →  & 热榜推荐，关闭；
17、主题壁纸 → 我的 → 设置 → 隐私设置 → 个性化推荐，关闭；
18、小米视频 → 我的 → 设置 → 消息与推送 → 接收小米推送 & 接收置顶消息，关闭；

可卸载：
19、天气 → ┇ → 设置 → 用户体验计划 → 天气视频卡片 & 内容推广，关闭；
20、游戏中心 → 我的 → 设置 → 隐私设置 → 个性化服务，关闭；
21、小米商城 → 我的 → 设置 → 消息推送 → 消息推送，关闭；
22、小米社区 → 头像 → 设置 → 隐私管理 → 详情页相似推荐 & 个性化推，关闭；
`;

const regSwitch = /通知|猜你喜欢|天气视频|桌面搜索|生活早报|用户体验|个性化|消息|广告|热[榜门]|推[荐广送]/gm;
const regSubPage = /(清理垃圾|简洁版|((通知|隐私|功能|个性化|信息流|用户体验|主页设置)(设置|管理|服务|计划)))/g;
console.log(text.match(regSwitch));
// console.log(text.match(regSubPage));
